app/Models/ModelAuth.php

SELECT *
FROM `admin`
WHERE `email` = 'michael.wahyurizky@student.upj.ac.id'
AND `password` = 'pemrogramanweb'
---
    public function login($email, $password)
    {
        return $this->db->table('admin')->where([
            'email'=>$email,
            'password'=>$password,
        ])->get()->getRowArray();